[
  {
    "text":   "Life is short. You need Python.",
    "author": "Bruce Eckel",
    "link":   "/articles/RP-why-choose-python-0-overview"
  },
  {
    "text":   "Bran Stark: Can a man still be brave if he's afraid? <br>Ned Stark: That is the only time a man can be brave.",
    "author": "TV episodes 《Game of Thrones》"
  },
  {
    "text": "Men decide where power resides, whether or not they know it.",
    "author": "TV episodes 《Game of Thrones》"
  },
  {
    "text": "There is nothing in the world more powerful than a good story.",
    "author": "TV episodes 《Game of Thrones》"
  },
  {
    "text": "You cannot answer a question you cannot ask, and you cannot ask a question you have no words for.",
    "author": "Judea Pearl & Dana Mackenzie, 《The Book of Why》"
  },
  {
    "text":"Readability counts.", 
    "author": "The Zen of Python"
  },
  {
    "text": "实用性大于意识形态",
    "author": "Arch Linux 中文社区 - Wiki - Arch_Linux (简体中文)"
  },
  {
    "text":"一个平静谦和的人生，比为了追求成功汲汲营营还能带来更多快乐",
    "author": "阿尔伯特·爱因斯坦"
  },
  {
    "text": "教育的价值在于训练思维，而不在于传授事实。",
    "author": "阿尔伯特·爱因斯坦"
  },
  {
    "text": "成功不必在我，功成其中有我",
    "author": "编程随想"
  },
  {
    "text":"程序必须首先让人类可以理解，然后顺便让机器能执行.",
    "author":"编程随想，引自 Gerald Jay Sussman, Hal Abelson 《Structure and Interpretation of Computer Programs (SICP)》"
  },
  {
    "text": "有些人喷着喷着，就把自己当例子给举出去了。:-)",
    "author": "《编程随想的博客》评论区"
  },
  {
    "text":   "人会长大三次：第一次是在发现自己不是世界中心的时候；第二次是在发现即使再怎么努力，终究还是有些事令人无能为力的时候；第三次是在明知道有些事可能会无能为力，但还是会尽力争取的时候。",
    "author": "鸟山明《龙珠》，Bilibili用户“阿卡林嫁给我吧”引用"
  },
  {
    "text": "历史是人的足迹。但并不是所有留下足迹的人都敢于正视自己的历史。",
    "author": "《穆斯林的葬礼》，Bilibili用户“阿卡林嫁给我吧”引用于《[深解佳作]三月的狮子Part5》"
  },
  {
    "text":   "一个人就算只有平凡无奇的本质，也会有一路向前的信心；一个人就算有经天纬地的才气，也会有不得不背负的苦难。",
    "author": "Bilibili用户“GigiKidd”，《蜂蜜与四叶草》评论区"
  },
  {
    "text": "比起你喜欢谁，更重要的是你喜欢跟谁在一起时的自己。",
    "author": "苍井优"
  },
  {
    "text":   "只要太空能够忍受，<br>只要生命依然存在，<br>瀑布的青春永不凋谢，<br>青春的瀑布更不会消逝，<br>一支火炬闪现如明月露脸，<br>失败过但没有眼泪。",
    "author": "陈冠中，《裸命》"
  },
  {
    "text": "人活在世上，有的活成了面子，有的活成了里子，都是时势使然。",
    "author": "电影《一代宗师》"
  },
  {
    "text":"环境不想让你做好一件事，或者想让你做不好一件事，但你把它做好了，这就是抵抗。",
    "author":"豆瓣用户 @朱岳"
  },
  {
    "text": "人应该管理的是精力与注意力而不是时间，这两者有很大的不同。",
    "author": "饭否用户 @郭家二少爷"
  },
  {
    "text":"当你还是个孩子的时候你就想长大，因为成年人可以为所欲为。如果你是个成年人，你也会因为同样的原因而想重新成为一个孩子。",
    "author":"饭否用户 @heavenblue"
  },
  {
    "text": "“荷花不知道，她自己就是夏天”——一小学生创作诗歌",
    "author": "饭否用户 @Lifbrasir"
  },
  {
    "text": "“你是非常可爱的人，真应该遇到最好的人，我也真希望我就是。”——王小波",
    "author": "饭否用户 @马冇冇"
  },
  {
    "text": "史学的工作是整理史料，不是作艺术的建设，不是做疏通的事业，不是去扶持或推倒这个运动，或那个主义。",
    "author": "傅斯年，《史学方法导论》"
  },
  {
    "text": "艺术广大之极，足以占据一个人。",
    "author": "福楼拜"
  },
  {
    "text":"即使在人类知识宝库里投进一粒沙子也是伟大的。",
    "author":"顾准，引自居里夫人"
  },
  {
    "text": "过滤应该由最终用户来决定，由终端用户的终端设备来执行",
    "author": "瓦乌·荷兰德，德国黑客"
  },
  {
    "text":   "朋友的主要功能之一就是：我们想施加而无法施加于敌人的惩罚，他们能够以一种较为温和也较为象征性的形式接受。",
    "author": "阿道斯·雷欧那德·赫胥黎，《美丽新世界》"
  },
  {
    "text": "穆斯塔法·蒙德：“跟受苦受难的太高代价比起来，现实的幸福看起来往往相当廉价。而且，稳定当然远远不如动乱那么热闹；心满意足也不如跟不幸做殊死斗争那么动人；也不如抗拒引诱，或是抗拒为激情和怀疑所颠倒那么引人入胜。幸福从来就不伟大。”",
    "author": "阿道斯·雷欧那德·赫胥黎，《美丽新世界》"
  },
  {
    "text": "穆斯塔法·蒙德：“那是为稳定所付出的又一项代价。跟幸福格格不入的不光是艺术，而且有科学。科学是危险的，我们得给它小心翼翼地套上笼头，拴上链子。”",
    "author": "阿道斯·雷欧那德·赫胥黎，《美丽新世界》"
  },
  {
    "text": "现在有人对你们说：“牺牲你们个人的自由，去求国家的自由！”<br>我对你们说：“争取个人的自由，就是争取国家的自由；争取个人的人格，就是争取国家的国格！自由平等的国家不是一群奴才建造得起来的！”",
    "author": "胡适，《介绍我自己的思想》"
  },
  {
    "text": "我吻你，吻你稚弱的但满是裂痕的手，吻你静穆而勇敢的心，吻你的永远的美丽。",
    "author": "黄永玉，《老婆呀！不要哭》"
  },
  {
    "text": "大丈夫行事，论是非不论利害，论逆顺不论成败，论万世不论一生。",
    "author": "黄宗羲，《宋元学案》引自《与李养吾书》"
  },
  {
    "text": "情报支持的是行动，信息仅支持理解。",
    "author": "iYouPort，《“情报不是简单的信息”：iYouPort 答读者问：关于我们为什么而存在？（下）》"
  },
  {
    "text": "风乍起，合当奋意向人生。",
    "author": "崛辰雄，《起风了》"
  },
  {
    "text": "不抛弃，也不放弃。",
    "author": "兰晓龙，《士兵突击》"
  },
  {
    "text":"保持译者光荣与骄傲的办法，就是译者本人保持谦卑。",
    "author":"李康，译者"
  },
  {
    "text": "在我看来，爱情不论发生在什么样的人之间，无论是同性异性、年老年轻、婚内婚外、两人还是多人，它都是一种不可多得的，所以值得珍视也值得尊重的人类体验。",
    "author":"李银河"
  },
  {
    "text":"我认为每个人都有权利决定如何使用自己的身体，包括怎样使用自己的性器官，都有权利追求个性化的性满足，只要不给别人带来伤害，就没有什么不可以。",
    "author":"李银河"
  },
  {
    "text": "我所受的社会学训练有一个规矩：社会学只关注两件事，一是是什么，二是为什么，绝对不可对研究对象做道德评判。我这“一辈子”谨遵此训，从未越雷池一步。无论研究对象是中国还是美国，从未做过道德评判，“一辈子吹捧”更不知从何说起。",
    "author": "李银河，《周小平文章点评》"
  },
  {
    "text": "让所有人都认同的文字称不上表达，表达需要勇气。",
    "author": "铃木光司"
  },
  {
    "text": "我先前的攻击社会，其实也是无聊的。社会没有知道我在攻击，倘一知道，我早已死无葬身之所了<br>……<br>我之得以偷生者，因为他们大多数不识字，不知道，并且我的话也无效力，如一箭之入大海。<br>否则，几条杂感，就可以送命的——民众的惩罚之心，并不下于学者和军阀。",
    "author": "鲁迅，《答有恒先生》，一九二七年"
  },
  {
    "text": "邓布利多：人们很容易原谅别人的错误，却很难原谅别人的正确。",
    "author": "J·K·罗琳"
  },
  {
    "text":"好的程序代码本身就是最好的文档。",
    "author": "Steve McConnell, 《代码大全》"
  },
  {
    "text":"在回信的最后， 泰森表示， 虽然科学家反对宗教对教育的渗透， 但他一直认为学校里应该有一门介绍各种宗教的课， 这样的课之所以没有设立， “从历史上讲， 是因为宗教自己从来就没有宽容其他宗教的雅量”。",
    "author":"卢昌海，《＜一位天体物理学家的来信＞》"
  },
  {
    "text": "20世纪中期以来的一个基本常识，历史是一种记忆，史学被当作一种记忆来讨论。但事实上，是遗忘在塑造我们的记忆，理解记忆的关键在于理解遗忘。……积极的遗忘，是出于某种目标，主动地、有意识地切断与过去之间联系的遗忘。焚书、文字狱、删帖、屏蔽敏感词或禁言，就是要造成一种主动的遗忘、一种强制性的遗忘。对于研究者来说，这样的遗忘是有历史学意义的。",
    "author": "罗新，《一切史料都是史学》"
  },
  {
    "text": "这两年十分红火的《人类简史》，虽然我并不认为它是一本很好的历史著作，但书里常常有一些很好的思想和表述。比如书里讲到为什么要研究历史，说历史和其他那些所谓科学的学科不同，历史不能试验、实验，不能反复发生，也不可预测。学习和研究历史，不是为了预测未来，而是为了扩大人类的视野，理解我们现在所处的情况既不是自然的，也不是不可避免的。我们必须知道，我们的过去有非常丰富的可能，而不是如今天呈现在我们面前、特别是呈现在某些叙述中的那样单一和绝对。",
    "author": "罗新，《一切史料都是史学》"
  },
  {
    "text": "任何瞬间的心动都不容易，不要怠慢了它。",
    "author": "毛姆，《爱德华·巴纳德的堕落》"
  },
  {
    "text": "不早熟，不是天才，但天才一定要晚成才好。",
    "author": "木心"
  },
  {
    "text": "诚觉世事皆可原谅，又不知该原谅什么。",
    "author": "木心"
  },
  {
    "text":"任何时代都不是艺术的时代，但我还是要写。",
    "author":"木心"
  },
  {
    "text": "他们忘却了违背了少年时的立志，自认为练达，自诩为聪明，觉得从前太幼稚，现在总算看透了想穿了，但就此变成了自己少年时最憎恶的那种人。",
    "author": "木心"
  },
  {
    "text": "修养是很具体的，就是一件件小事。一句话熬不住，就失了教养。",
    "author": "木心"
  },
  {
    "text": "在自己的身上，克服这个时代。",
    "author": "木心"
  },
  {
    "text":"知识使人自由，或者起码渴望自由。",
    "author":"[南非] 特雷弗·诺亚，《天生有罪》"
  },
  {
    "text": "Across the Great Wall we can reach every corner in the world.",
    "author": "钱天白，中国第一封电子邮件"
  },
  {
    "text": "有时，有些学科，经常让人成为四流科学家而得意洋洋。",
    "author": "Peyton Rous，饶毅翻译"
  },
  {
    "text": "一个普通智力的人会说那个命题是显而易见无需证明的，一个好点的数学家会意识到证明的必要并试图证明它，只有非凡的天才才会意识到证明是需要却办不到的。",
    "author": "乔治·萨顿 (George Sarton)，科学史学家，评价平行公设"
  },
  {
    "text":"所以隐忍苟活，函粪土之中而不辞者，恨私心有所不尽，鄙没世而文采不表于后也。",
    "author":"司马迁，《报任安书》"
  },
  {
    "text": "金钱的奴隶挥着鞭子，在用金钱买来的奴隶面前摆出个主人的样子，只是人们没有自觉罢了，其实每个人都是某种东西的奴隶。",
    "author": "TV 动画《冰海战纪》"
  },
  {
    "text":"昨日之敌乃是今日之友。",
    "author":"TV 动画《少女与战车》"
  },
  {
    "text":"把「I Love You」翻译成「月色真美」的，是太宰治？还是夏目漱石啊？",
    "author":"TV 动画《月色真美》"
  },
  {
    "text":"我尚未看到任何一位 20 世纪以来的大学哲学系培养的哲学家，对我们有关自然界的理解做出过任何实质推进。",
    "author":"尼尔·泰森，天体物理学家"
  },
  {
    "text":"数学模型本身也是近似的……在这种情况下， 一定非要求出它的精确解本身就是一个苛刻且不必要的要求",
    "author":"汤涛，《从圆周率计算浅谈计算数学》"
  },
  {
    "text": "任何天才都不可能在孤独中得到发展。",
    "author": "列夫·托尔斯泰"
  },
  {
    "text":"知识分子最大的罪恶是建造关押自己的思想监狱。",
    "author":"王小波"
  },
  {
    "text":"你有种美好的信念，我很尊重，但要硬塞给我，我就不那么乐意。",
    "author":"王小波"
  },
  {
    "text":"在一个喧嚣的话语圈下面，之中有个沉默的大多数。既然精神原子弹在一颗又一颗地炸着，哪里有我们说话的份？但我辈现在开始说话，以前说过的一切和我们都无关系——总而言之，是个一刀两断的意思。千里之行始于足下，中国要有自由派，就从我辈开始。是不是太狂了？",
    "author":"王小波"
  },
  {
    "text":"我已经四十岁了，除了这只猪，还没见过谁敢于如此无视对生活的设置。相反，我到见过很多想要设置别人生活的人，还有对被设置的生活安之若素的人。 ",
    "author":"王小波"
  },
  {
    "text":"我现在所教的数学，你们也许一生都用不到，但我还要教，因为这些知识是好的，应该让你们知道。",
    "author":"王小波引述其数学老师"
  },
  {
    "text":"“辩证法”的政治化，则把这个认识世界的锐利武器，变成了诡辩、扣帽子的工具。只要与人争论、或是攻击他人、或是为自己辩解，动不动就要搬出“辩证法”，互相攻讦。当然，取得胜利的关键还在于力量或权力。身处劣势的，巧舌如簧，口吐莲花也不行。然而“辩证法”巧妙运用确实也能征服一些持中立态度和傍观的人们。仿佛真是“辩证法”的威力，他们也会照猫画虎，在现实中广泛运用，这样便造就了一大批“智足以拒谏，辩足以饰非”的人们，似乎什麽时候和怎麽说他都有理。",
    "author": "王学泰"
  },
  {
    "text": "消灭了尖锐的批评声，温和的批评声就变得刺耳了。消灭了温和的批评声，连沉默都变得居心叵测。当沉默也被消灭时，夸赞得不够卖力就是一种犯罪。",
    "author": "微博用户“世界上最小的一篇阿司匹林”"
  },
  {
    "text":"国人看起来勤奋，但总在关键的地方偷懒。",
    "author":"微信用户“善和”，公众号“时代之”《是时候，拯救家长们的智商了》评论区"
  },
  {
    "text":"林田高志：百思不如一试，根据我的经验，这句话十有八九是真的。",
    "author":"羽海野千花，《三月的狮子》"
  },
  {
    "text":"林田高志：如果一个人走投无路了，那就去依靠别人，否则别人其实也无法来依靠你。",
    "author":"羽海野千花，《三月的狮子》"
  },
  {
    "text":"人的一生在历史长河中很短，但政治气候变化莫测，而你的文字白纸黑字是会永久留存的。将来时空变幻又如何以此文字面对自己同行乃至后代？",
    "author":"张千帆"
  },
  {
    "text":"只有在一个赏罚分明、贪污绝迹、纪律振肃的国家，社会才有是非，才有公道，而民众才会明礼义，知廉耻，有纪律，守秩序。否则，在好人终是吃亏的变态社会律下，有谁愿肃身自好呢？",
    "author":"章渊若，法学家"
  }
]